Ran Plan for dir: `env/stg/apne2/devops` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.ec2.aws_instance.ec2["search-opensearch-single"] must be replaced
+/- resource "aws_instance" "ec2" {
      ~ arn                                  = "arn:aws:ec2:ap-northeast-2:842675972665:instance/i-0ff069ddc829a3113" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "ap-northeast-2a" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0ff069ddc829a3113" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-004997d4c5c065afa" -> (known after apply)
      ~ private_dns                          = "ip-172-21-10-121.ap-northeast-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.21.10.121" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name"      = "search-opensearch-single-stg"
            "createdBy" = "devops@example.com"
            "env"       = "stg"
            "managedBy" = "terraform-admin"
            "project"   = "search-recommand"
            "service"   = "search-recommand"
            "teamTag"   = "devops"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (11 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 2 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-095b15a41e10e19a7" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.elb.aws_lb.alb["search-recommand-alb"] will be created
+ resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 300
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "search-recommand-alb-stg"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-02fec3dbcf369b29f",
        ]
      + subnets                                                      = [
          + "subnet-00353ddd11c7db3b7",
          + "subnet-0e39ed5af967f6272",
          + "subnet-0f5a112cd3c5ed2dc",
        ]
      + tags                                                         = {
          + "Name"      = "search-recommand-alb-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                                                     = {
          + "Name"      = "search-recommand-alb-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.elb.aws_lb_listener.alb_listener["search-alb-http-listener"] will be created
+ resource "aws_lb_listener" "alb_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Name"      = "search-alb-http-listener-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                                                              = {
          + "Name"      = "search-alb-http-listener-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.elb.aws_lb_listener_rule.alb_listener_rule["search-elasticsearch-alb-http-listener-rule"] will be created
+ resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 2
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/elasticsearch",
                ]
            }
        }
    }

  # module.elb.aws_lb_listener_rule.alb_listener_rule["search-opensearch-alb-http-listener-rule"] will be created
+ resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 1
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/vector",
                ]
            }
        }
    }

  # module.elb.aws_lb_target_group.target_group["search-elasticsearch-alb-tg"] will be created
+ resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "search-elasticsearch-alb-tg-stg"
      + name_prefix                        = (known after apply)
      + port                               = 10092
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"      = "search-elasticsearch-alb-tg-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                           = {
          + "Name"      = "search-elasticsearch-alb-tg-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0d27adb5dc9f070dc"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health-check"
          + port                = "10092"
          + protocol            = "HTTP"
          + timeout             = 15
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.elb.aws_lb_target_group.target_group["search-opensearch-alb-tg"] will be created
+ resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "search-opensearch-alb-tg-stg"
      + name_prefix                        = (known after apply)
      + port                               = 10091
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"      = "search-opensearch-alb-tg-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                           = {
          + "Name"      = "search-opensearch-alb-tg-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0d27adb5dc9f070dc"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health-check"
          + port                = "10091"
          + protocol            = "HTTP"
          + timeout             = 15
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

Plan: 7 to add, 0 to change, 1 to destroy.

Changes to Outputs:
+ debug_ecr_module     = (sensitive value)
+ debug_ecs_module     = (sensitive value)
+ debug_iam_module     = (sensitive value)
+ debug_network_module = (sensitive value)
+ debug_storage_module = (sensitive value)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d env/stg/apne2/devops
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://df0c66c24d92:4141/lock?id=DevOpsTechGroup%252Fsearch-recommand-terraform%252Fenv%252Fstg%252Fapne2%252Fdevops%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d env/stg/apne2/devops
  ```
Plan: 7 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```